

const timelinesInfo = 
    {
        kupala:[{
            name: "Детство и юность",
            date: "	7 июля 1882",
            description: "Родился в белорусской католической семье Доминика Онуфриевича Луцевича и Бенигны Ивановны Луцевич(урождённой Волосевич)."+
"Родители были обедневшие белорусские шляхтичи, арендовавшие земли в помещичьих угодьях.Род Луцевичей известен с начала XVII века.Дед поэта арендовал землю у Радзивиллов, но был ими изгнан с родных мест.Этот факт лёг в основу купаловской драмы «Раскіданае гняздо»."
        },
        {
            name: "Первые публикации",
            date: "1905 - 1908",
            description: "Первые произведения Купалы — несколько лирических стихотворений на польском языке, опубликованы в 1903—1904 годах в журнале «Ziarno» («Зерно») под псевдонимом «К-а». Первое стихотворение на белорусском языке — «Мая доля» датируется 15 июля 1904 года",
        },
        {
            name: "Советский период",
            date: "1922 - 1940",
            description: "С наступлением советской эпохи лирические настроения Янки Купалы подверглись некоторым изменениям. На первый план в его стихотворениях вышел мотив ожидания светлого будущего; поэт возлагал искренние надежды на коренные изменения в жизни белорусского народа под влиянием новой эпохи",
        }],
    kolas: [{
        name: "Юность",
        date: "1882",
        description: "Родился 22 октября (3 ноября) 1882 года в деревне Акинчицы (теперь территория города Столбцы Столбцовского района Минской области Белоруссии), в православной семье лесника Михаила Казимировича (Михася) Мицкевича и домохозяйки Анны Юрьевны Лесик. Предки по отцовской линии — католики",
    },
    {
        name: "Переезд в подмосковье",
        date: "1915",
        description: "В 1915 году эвакуировался вместе с семьёй в Подмосковье, работал учителем в Дмитровском уезде. В этом же году мобилизован в армию. Окончил Александровское военное училище (Москва, 1916) и служил в запасном полку в Перми. В это время его семья переехала в Обоянь (Курская губерния). В звании подпоручика летом 1917 года был отправлен на Румынский фронт.",
    },
    {
        name: "Смерть",
        date: "13 августа 1956 года",
        description: "В конце жизни часто болел, в частности, перенёс 26 воспалений лёгких.Скончался 13 августа 1956 года.Похоронен на Военном кладбище в Минске",
        }],
    bykov: [{
        name: "Юность",
        date: "1924",
        description: "Родился 19 июня 1924 года в деревне Бычки Ушачского района Витебской области в крестьянской семье. С детства увлекался рисованием. Окончил 8 классов школы в деревне Кубличи, затем учился на скульптурном отделении Витебского художественного училища (1939—1940), которое оставил из-за отмены стипендий[7], и в школе ФЗО (до мая 1941 года). В июне 1941 года экстерном сдал экзамены за 10 класс.",
    },
    {
        name: "Армия",
        date: "1942",
        description: "Призван в армию летом 1942 года, окончил Саратовское пехотное училище. Осенью 1943 года присвоено звание младшего лейтенанта. Участвовал в боях за Кривой Рог, Александрию, Знаменку. Во время Кировоградской операции ранен в ногу и живот (по ошибке был записан как погибший); события после ранения послужили основой повести «Мёртвым не больно». В начале 1944 года три месяца находился в госпитале. Затем участвовал в Ясско-Кишинёвской операции, освобождении Румынии.",
    },
    {
        name: "Смерть",
        date: "22 июня 2003 года",
        description: "Василь Владимирович Быков умер 22 июня 2003 года в 20 часов 30 минут от злокачественной опухоли желудка в реанимационном отделении онкологического госпиталя в Боровлянах, под Минском",
        }],
    shamiakin: [{
        name: "Юность",
        date: "30 января 1921",
        description: "Родился 30 января 1921 года в деревне Корма Гомельского уезда Гомельской губернии (ныне Добрушского района Гомельской области Беларуси) в крестьянской семье.В 1936 году окончил семь классов Маковской школы, продолжил учёбу в Гомельском техникуме строительных материалов(1936—1940).По окончании техникума работал техником- технологом кирпичного завода в Белостоке.Ещё в техникуме начал писать стихи, участвовал в заседаниях литературного объединения при газете «Гомельская правда».",
    },
    {
        name: "Творчество",
        date: "1944-1986",
            description: "В 1944 году написал рассказ на белорусском языке «У снежнай пустыні» (опубликован в 1946 году). Первым крупным произведением И. П. Шамякина была повесть «Помста», опубликованная в 1945 году в белорусском журнале «Полымя».В 1957 году появляется роман о жизни сельской интеллигенции под названием «Криницы» (белор.«Крыніцы»), экранизированный режиссёром Иосифом Шульманом на киностудии Беларусьфильм(1964)",
    },],
     };

export default timelinesInfo;